```[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mmodule.networking.data.aws_availability_zones.available: Refreshing state... [id=2020-08-13 11:04:37.745719697 +0000 UTC][0m
[0m[1mmodule.bastion.data.aws_ami.this: Refreshing state... [id=ami-0ded330691a314693][0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
 [36m<=[0m read (data resources)
[0m
Terraform will perform the following actions:

[1m  # module.bastion.aws_instance.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_instance" "this" {
      [32m+[0m [0m[1m[0mami[0m[0m                          = "ami-0ded330691a314693"
      [32m+[0m [0m[1m[0marn[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0massociate_public_ip_address[0m[0m  = true
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcpu_core_count[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mcpu_threads_per_core[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mget_password_data[0m[0m            = false
      [32m+[0m [0m[1m[0mhost_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0minstance_state[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0minstance_type[0m[0m                = "t2.micro"
      [32m+[0m [0m[1m[0mipv6_address_count[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mipv6_addresses[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mkey_name[0m[0m                     = "bastion-key"
      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mpassword_data[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mplacement_group[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mprimary_network_interface_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mpublic_dns[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0msecondary_private_ips[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msource_dest_check[0m[0m            = true
      [32m+[0m [0m[1m[0msubnet_id[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                         = {
          [32m+[0m [0m"Name" = "Bastion"
        }
      [32m+[0m [0m[1m[0mtenancy[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mvolume_tags[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m       = (known after apply)

      [32m+[0m [0mebs_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }

      [32m+[0m [0mephemeral_block_device {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)
        }

      [32m+[0m [0mmetadata_options {
          [32m+[0m [0m[1m[0mhttp_endpoint[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mhttp_tokens[0m[0m                 = (known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)
        }

      [32m+[0m [0mroot_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }
    }

[1m  # module.bastion.aws_key_pair.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_key_pair" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mkey_name[0m[0m    = "bastion-key"
      [32m+[0m [0m[1m[0mkey_pair_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mpublic_key[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m        = {
          [32m+[0m [0m"Name" = "Bastion Key"
        }
    }

[1m  # module.bastion.aws_security_group.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "Managed by Terraform"
      [32m+[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 0
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "-1"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 0
            },
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"101.181.70.69/32",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 22
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 22
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "bastion"
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Name" = "Bastion SG"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # module.bastion.local_file.bastion_private_key[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "local_file" "bastion_private_key" {
      [32m+[0m [0m[1m[0mdirectory_permission[0m[0m = "0777"
      [32m+[0m [0m[1m[0mfile_permission[0m[0m      = "0600"
      [32m+[0m [0m[1m[0mfilename[0m[0m             = "bastion.pem"
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0msensitive_content[0m[0m    = (sensitive value)
    }

[1m  # module.bastion.tls_private_key.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "tls_private_key" "this" {
      [32m+[0m [0m[1m[0malgorithm[0m[0m                  = "RSA"
      [32m+[0m [0m[1m[0mecdsa_curve[0m[0m                = "P224"
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mprivate_key_pem[0m[0m            = (sensitive value)
      [32m+[0m [0m[1m[0mpublic_key_fingerprint_md5[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mpublic_key_openssh[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpublic_key_pem[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mrsa_bits[0m[0m                   = 4096
    }

[1m  # module.ecs.data.aws_ecs_task_definition.wordpress[0m will be read during apply
  # (config refers to values not yet known)[0m[0m
[0m [36m<=[0m[0m data "aws_ecs_task_definition" "wordpress"  {
      [32m+[0m [0m[1m[0mfamily[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_mode[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mrevision[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mtask_definition[0m[0m = "2020-jun-project1-externals"
      [32m+[0m [0m[1m[0mtask_role_arn[0m[0m   = (known after apply)
    }

[1m  # module.ecs.aws_alb.wp_alb[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_alb" "wp_alb" {
      [32m+[0m [0m[1m[0marn[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0marn_suffix[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mdns_name[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mdrop_invalid_header_fields[0m[0m = false
      [32m+[0m [0m[1m[0menable_deletion_protection[0m[0m = false
      [32m+[0m [0m[1m[0menable_http2[0m[0m               = true
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0midle_timeout[0m[0m               = 60
      [32m+[0m [0m[1m[0minternal[0m[0m                   = false
      [32m+[0m [0m[1m[0mip_address_type[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mload_balancer_type[0m[0m         = "application"
      [32m+[0m [0m[1m[0mname[0m[0m                       = "2020-jun-project1-externals-alb"
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msubnets[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                       = {
          [32m+[0m [0m"Environment" = "2020-jun-project1-externals"
          [32m+[0m [0m"Name"        = "2020-jun-project1-externals-alb"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mzone_id[0m[0m                    = (known after apply)

      [32m+[0m [0msubnet_mapping {
          [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mprivate_ipv4_address[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msubnet_id[0m[0m            = (known after apply)
        }
    }

[1m  # module.ecs.aws_alb_listener.web_app[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_alb_listener" "web_app" {
      [32m+[0m [0m[1m[0marn[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mcertificate_arn[0m[0m   = "arn:aws:acm:ap-southeast-2:348248800869:certificate/0c6d4095-dd02-4717-bff1-b076303dd2cd"
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mload_balancer_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mport[0m[0m              = 443
      [32m+[0m [0m[1m[0mprotocol[0m[0m          = "HTTPS"
      [32m+[0m [0m[1m[0mssl_policy[0m[0m        = (known after apply)

      [32m+[0m [0mdefault_action {
          [32m+[0m [0m[1m[0morder[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mtarget_group_arn[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m             = "forward"
        }
    }

[1m  # module.ecs.aws_alb_target_group.target_group[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_alb_target_group" "target_group" {
      [32m+[0m [0m[1m[0marn[0m[0m                                = (known after apply)
      [32m+[0m [0m[1m[0marn_suffix[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mderegistration_delay[0m[0m               = 300
      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mlambda_multi_value_headers_enabled[0m[0m = false
      [32m+[0m [0m[1m[0mload_balancing_algorithm_type[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                               = "wordpressalbtg01"
      [32m+[0m [0m[1m[0mport[0m[0m                               = 80
      [32m+[0m [0m[1m[0mprotocol[0m[0m                           = "HTTP"
      [32m+[0m [0m[1m[0mproxy_protocol_v2[0m[0m                  = false
      [32m+[0m [0m[1m[0mslow_start[0m[0m                         = 0
      [32m+[0m [0m[1m[0mtarget_type[0m[0m                        = "ip"
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                             = (known after apply)

      [32m+[0m [0mhealth_check {
          [32m+[0m [0m[1m[0menabled[0m[0m             = true
          [32m+[0m [0m[1m[0mhealthy_threshold[0m[0m   = 3
          [32m+[0m [0m[1m[0minterval[0m[0m            = 60
          [32m+[0m [0m[1m[0mmatcher[0m[0m             = "200-302,404"
          [32m+[0m [0m[1m[0mpath[0m[0m                = "/index.html"
          [32m+[0m [0m[1m[0mport[0m[0m                = "80"
          [32m+[0m [0m[1m[0mprotocol[0m[0m            = "HTTP"
          [32m+[0m [0m[1m[0mtimeout[0m[0m             = 30
          [32m+[0m [0m[1m[0munhealthy_threshold[0m[0m = 3
        }

      [32m+[0m [0mstickiness {
          [32m+[0m [0m[1m[0mcookie_duration[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m            = (known after apply)
        }
    }

[1m  # module.ecs.aws_appautoscaling_policy.app_down[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appautoscaling_policy" "app_down" {
      [32m+[0m [0m[1m[0marn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "2020-jun-project1-externals-scale-down"
      [32m+[0m [0m[1m[0mpolicy_type[0m[0m        = "StepScaling"
      [32m+[0m [0m[1m[0mresource_id[0m[0m        = "service/2020-jun-project1-externals/2020-jun-project1-externals"
      [32m+[0m [0m[1m[0mscalable_dimension[0m[0m = "ecs:service:DesiredCount"
      [32m+[0m [0m[1m[0mservice_namespace[0m[0m  = "ecs"

      [32m+[0m [0mstep_scaling_policy_configuration {
          [32m+[0m [0m[1m[0madjustment_type[0m[0m         = "ChangeInCapacity"
          [32m+[0m [0m[1m[0mcooldown[0m[0m                = 300
          [32m+[0m [0m[1m[0mmetric_aggregation_type[0m[0m = "Average"

          [32m+[0m [0mstep_adjustment {
              [32m+[0m [0m[1m[0mmetric_interval_upper_bound[0m[0m = "0"
              [32m+[0m [0m[1m[0mscaling_adjustment[0m[0m          = -1
            }
        }
    }

[1m  # module.ecs.aws_appautoscaling_policy.app_up[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appautoscaling_policy" "app_up" {
      [32m+[0m [0m[1m[0marn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "2020-jun-project1-externals-app-scale-up"
      [32m+[0m [0m[1m[0mpolicy_type[0m[0m        = "StepScaling"
      [32m+[0m [0m[1m[0mresource_id[0m[0m        = "service/2020-jun-project1-externals/2020-jun-project1-externals"
      [32m+[0m [0m[1m[0mscalable_dimension[0m[0m = "ecs:service:DesiredCount"
      [32m+[0m [0m[1m[0mservice_namespace[0m[0m  = "ecs"

      [32m+[0m [0mstep_scaling_policy_configuration {
          [32m+[0m [0m[1m[0madjustment_type[0m[0m         = "ChangeInCapacity"
          [32m+[0m [0m[1m[0mcooldown[0m[0m                = 60
          [32m+[0m [0m[1m[0mmetric_aggregation_type[0m[0m = "Average"

          [32m+[0m [0mstep_adjustment {
              [32m+[0m [0m[1m[0mmetric_interval_lower_bound[0m[0m = "0"
              [32m+[0m [0m[1m[0mscaling_adjustment[0m[0m          = 1
            }
        }
    }

[1m  # module.ecs.aws_appautoscaling_target.app_scale_target[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appautoscaling_target" "app_scale_target" {
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mmax_capacity[0m[0m       = 4
      [32m+[0m [0m[1m[0mmin_capacity[0m[0m       = 2
      [32m+[0m [0m[1m[0mresource_id[0m[0m        = "service/2020-jun-project1-externals/2020-jun-project1-externals"
      [32m+[0m [0m[1m[0mrole_arn[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mscalable_dimension[0m[0m = "ecs:service:DesiredCount"
      [32m+[0m [0m[1m[0mservice_namespace[0m[0m  = "ecs"
    }

[1m  # module.ecs.aws_cloudwatch_log_group.ecs[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "ecs" {
      [32m+[0m [0m[1m[0marn[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m              = "/ecs/2020-jun-project1-externals"
      [32m+[0m [0m[1m[0mretention_in_days[0m[0m = 1
    }

[1m  # module.ecs.aws_cloudwatch_metric_alarm.cpu_utilization_high[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cloudwatch_metric_alarm" "cpu_utilization_high" {
      [32m+[0m [0m[1m[0mactions_enabled[0m[0m                       = true
      [32m+[0m [0m[1m[0malarm_actions[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0malarm_name[0m[0m                            = "2020-jun-project1-externals-CPU-Utilization-High"
      [32m+[0m [0m[1m[0marn[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0mcomparison_operator[0m[0m                   = "GreaterThanOrEqualToThreshold"
      [32m+[0m [0m[1m[0mdimensions[0m[0m                            = {
          [32m+[0m [0m"ClusterName" = "2020-jun-project1-externals"
          [32m+[0m [0m"ServiceName" = "2020-jun-project1-externals"
        }
      [32m+[0m [0m[1m[0mevaluate_low_sample_count_percentiles[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mevaluation_periods[0m[0m                    = 1
      [32m+[0m [0m[1m[0mid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0mmetric_name[0m[0m                           = "CPUUtilization"
      [32m+[0m [0m[1m[0mnamespace[0m[0m                             = "AWS/ECS"
      [32m+[0m [0m[1m[0mperiod[0m[0m                                = 60
      [32m+[0m [0m[1m[0mstatistic[0m[0m                             = "Average"
      [32m+[0m [0m[1m[0mthreshold[0m[0m                             = 80
      [32m+[0m [0m[1m[0mtreat_missing_data[0m[0m                    = "missing"
    }

[1m  # module.ecs.aws_cloudwatch_metric_alarm.cpu_utilization_low[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cloudwatch_metric_alarm" "cpu_utilization_low" {
      [32m+[0m [0m[1m[0mactions_enabled[0m[0m                       = true
      [32m+[0m [0m[1m[0malarm_actions[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0malarm_name[0m[0m                            = "2020-jun-project1-externals-CPU-Utilization-Low"
      [32m+[0m [0m[1m[0marn[0m[0m                                   = (known after apply)
      [32m+[0m [0m[1m[0mcomparison_operator[0m[0m                   = "LessThanThreshold"
      [32m+[0m [0m[1m[0mdimensions[0m[0m                            = {
          [32m+[0m [0m"ClusterName" = "2020-jun-project1-externals"
          [32m+[0m [0m"ServiceName" = "2020-jun-project1-externals"
        }
      [32m+[0m [0m[1m[0mevaluate_low_sample_count_percentiles[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mevaluation_periods[0m[0m                    = 1
      [32m+[0m [0m[1m[0mid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0mmetric_name[0m[0m                           = "CPUUtilization"
      [32m+[0m [0m[1m[0mnamespace[0m[0m                             = "AWS/ECS"
      [32m+[0m [0m[1m[0mperiod[0m[0m                                = 60
      [32m+[0m [0m[1m[0mstatistic[0m[0m                             = "Average"
      [32m+[0m [0m[1m[0mthreshold[0m[0m                             = 30
      [32m+[0m [0m[1m[0mtreat_missing_data[0m[0m                    = "missing"
    }

[1m  # module.ecs.aws_ecr_repository.wprepo[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecr_repository" "wprepo" {
      [32m+[0m [0m[1m[0marn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mimage_tag_mutability[0m[0m = "MUTABLE"
      [32m+[0m [0m[1m[0mname[0m[0m                 = "wordpress"
      [32m+[0m [0m[1m[0mregistry_id[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mrepository_url[0m[0m       = (known after apply)

      [32m+[0m [0mimage_scanning_configuration {
          [32m+[0m [0m[1m[0mscan_on_push[0m[0m = false
        }
    }

[1m  # module.ecs.aws_ecs_cluster.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecs_cluster" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m = "2020-jun-project1-externals"

      [32m+[0m [0msetting {
          [32m+[0m [0m[1m[0mname[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mvalue[0m[0m = (known after apply)
        }
    }

[1m  # module.ecs.aws_ecs_service.wordpress[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecs_service" "wordpress" {
      [32m+[0m [0m[1m[0mcluster[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mdeployment_maximum_percent[0m[0m         = 200
      [32m+[0m [0m[1m[0mdeployment_minimum_healthy_percent[0m[0m = 100
      [32m+[0m [0m[1m[0mdesired_count[0m[0m                      = 2
      [32m+[0m [0m[1m[0menable_ecs_managed_tags[0m[0m            = false
      [32m+[0m [0m[1m[0mforce_new_deployment[0m[0m               = true
      [32m+[0m [0m[1m[0miam_role[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mlaunch_type[0m[0m                        = "FARGATE"
      [32m+[0m [0m[1m[0mname[0m[0m                               = "2020-jun-project1-externals"
      [32m+[0m [0m[1m[0mplatform_version[0m[0m                   = "1.4.0"
      [32m+[0m [0m[1m[0mscheduling_strategy[0m[0m                = "REPLICA"
      [32m+[0m [0m[1m[0mtask_definition[0m[0m                    = (known after apply)

      [32m+[0m [0mload_balancer {
          [32m+[0m [0m[1m[0mcontainer_name[0m[0m   = "wordpress"
          [32m+[0m [0m[1m[0mcontainer_port[0m[0m   = 80
          [32m+[0m [0m[1m[0mtarget_group_arn[0m[0m = (known after apply)
        }

      [32m+[0m [0mnetwork_configuration {
          [32m+[0m [0m[1m[0massign_public_ip[0m[0m = true
          [32m+[0m [0m[1m[0msecurity_groups[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0msubnets[0m[0m          = (known after apply)
        }
    }

[1m  # module.ecs.aws_ecs_task_definition.wordpress[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecs_task_definition" "wordpress" {
      [32m+[0m [0m[1m[0marn[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mcontainer_definitions[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mcpu[0m[0m                      = "256"
      [32m+[0m [0m[1m[0mexecution_role_arn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mfamily[0m[0m                   = "2020-jun-project1-externals"
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mmemory[0m[0m                   = "512"
      [32m+[0m [0m[1m[0mnetwork_mode[0m[0m             = "awsvpc"
      [32m+[0m [0m[1m[0mrequires_compatibilities[0m[0m = [
          [32m+[0m [0m"FARGATE",
        ]
      [32m+[0m [0m[1m[0mrevision[0m[0m                 = (known after apply)

      [32m+[0m [0mvolume {
          [32m+[0m [0m[1m[0mname[0m[0m = "efs-volume"

          [32m+[0m [0mefs_volume_configuration {
              [32m+[0m [0m[1m[0mfile_system_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mroot_directory[0m[0m = "/"
            }
        }
    }

[1m  # module.ecs.aws_iam_policy.ecrpolicy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_policy" "ecrpolicy" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "Policy to access ECR"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "ecrpolicy"
      [32m+[0m [0m[1m[0mpath[0m[0m        = "/"
      [32m+[0m [0m[1m[0mpolicy[0m[0m      = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"ecr:BatchCheckLayerAvailability",
                          [32m+[0m [0m"ecr:BatchGetImage",
                          [32m+[0m [0m"ecr:GetDownloadUrlForLayer",
                          [32m+[0m [0m"ecr:GetAuthorizationToken",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
    }

[1m  # module.ecs.aws_iam_role.ecs[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "ecs" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m [0mVersion   = "2008-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "2020-jun-project1-externals-ecs-role"
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)
    }

[1m  # module.ecs.aws_iam_role_policy_attachment.ecs1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ecs1" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      [32m+[0m [0m[1m[0mrole[0m[0m       = "2020-jun-project1-externals-ecs-role"
    }

[1m  # module.ecs.aws_iam_role_policy_attachment.ecs2[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ecs2" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m       = "2020-jun-project1-externals-ecs-role"
    }

[1m  # module.ecs.aws_route53_record.wp_route53[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route53_record" "wp_route53" {
      [32m+[0m [0m[1m[0mallow_overwrite[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfqdn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "wp"
      [32m+[0m [0m[1m[0mtype[0m[0m            = "A"
      [32m+[0m [0m[1m[0mzone_id[0m[0m         = "ZZ90LZK3RNF5D"

      [32m+[0m [0malias {
          [32m+[0m [0m[1m[0mevaluate_target_health[0m[0m = true
          [32m+[0m [0m[1m[0mname[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mzone_id[0m[0m                = (known after apply)
        }
    }

[1m  # module.ecs.aws_security_group.wordpress[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "wordpress" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "ECS Security Group"
      [32m+[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 0
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "-1"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 0
            },
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"10.0.0.0/16",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 443
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 443
            },
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"10.0.0.0/16",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 80
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 80
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "project1_ext1_ecs_sg"
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # module.ecs.aws_security_group.wpalb_sg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "wpalb_sg" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "ALB Security Group"
      [32m+[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 0
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "-1"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 0
            },
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 443
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 443
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "project1_ext1_wpalb_sg"
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Name" = "project1_ext1_wpalb_sg"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # module.efs.aws_efs_access_point.ap[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ap" {
      [32m+[0m [0m[1m[0marn[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m            = {
          [32m+[0m [0m"Name" = "wordpress"
        }

      [32m+[0m [0mroot_directory {
          [32m+[0m [0m[1m[0mpath[0m[0m = "/wordpress"

          [32m+[0m [0mcreation_info {
              [32m+[0m [0m[1m[0mowner_gid[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mowner_uid[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mpermissions[0m[0m = (known after apply)
            }
        }
    }

[1m  # module.efs.aws_efs_file_system.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_efs_file_system" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mcreation_token[0m[0m   = "wordpress"
      [32m+[0m [0m[1m[0mdns_name[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mencrypted[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mperformance_mode[0m[0m = "generalPurpose"
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name" = "wordpress"
        }
      [32m+[0m [0m[1m[0mthroughput_mode[0m[0m  = "bursting"
    }

[1m  # module.efs.aws_efs_mount_target.mnt1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_efs_mount_target" "mnt1" {
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdns_name[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_arn[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mip_address[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mmount_target_dns_name[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m              = (known after apply)
    }

[1m  # module.efs.aws_efs_mount_target.mnt2[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_efs_mount_target" "mnt2" {
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zone_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdns_name[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_arn[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mfile_system_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mip_address[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mmount_target_dns_name[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecurity_groups[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m              = (known after apply)
    }

[1m  # module.efs.aws_security_group.efs_sg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "efs_sg" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "EFS Security Group"
      [32m+[0m [0m[1m[0megress[0m[0m                 = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = [
                  [32m+[0m [0m"0.0.0.0/0",
                ]
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 0
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "-1"
              [32m+[0m [0msecurity_groups  = []
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 0
            },
        ]
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_blocks      = []
              [32m+[0m [0mdescription      = ""
              [32m+[0m [0mfrom_port        = 2049
              [32m+[0m [0mipv6_cidr_blocks = []
              [32m+[0m [0mprefix_list_ids  = []
              [32m+[0m [0mprotocol         = "tcp"
              [32m+[0m [0msecurity_groups  = (known after apply)
              [32m+[0m [0mself             = false
              [32m+[0m [0mto_port          = 2049
            },
        ]
      [32m+[0m [0m[1m[0mname[0m[0m                   = "project1_ext1_efs_sg"
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # module.networking.data.aws_availability_zones.available[0m will be read during apply
  # (config refers to values not yet known)[0m[0m
[0m [36m<=[0m[0m data "aws_availability_zones" "available"  {
        [1m[0mgroup_names[0m[0m = [
            "ap-southeast-2",
        ]
      [33m~[0m [0m[1m[0mid[0m[0m          = "2020-08-13 11:04:46.302853298 +0000 UTC" [33m->[0m [0m"2020-08-13 11:04:49.488639085 +0000 UTC"
        [1m[0mnames[0m[0m       = [
            "ap-southeast-2a",
            "ap-southeast-2b",
            "ap-southeast-2c",
        ]
        [1m[0mzone_ids[0m[0m    = [
            "apse2-az3",
            "apse2-az1",
            "apse2-az2",
        ]
    }

[1m  # module.networking.aws_eip.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eip" "this" {
      [32m+[0m [0m[1m[0mallocation_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0massociation_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mcustomer_owned_ip[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdomain[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0minstance[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprivate_dns[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mpublic_dns[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ipv4_pool[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mvpc[0m[0m               = true
    }

[1m  # module.networking.aws_internet_gateway.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_internet_gateway" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"Name" = "wp_igw"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m   = (known after apply)
    }

[1m  # module.networking.aws_nat_gateway.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_nat_gateway" "this" {
      [32m+[0m [0m[1m[0mallocation_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpublic_ip[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                 = {
          [32m+[0m [0m"Name" = "wp_nat_gateway"
        }
    }

[1m  # module.networking.aws_network_acl.private[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl" "private" {
      [32m+[0m [0m[1m[0marn[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0megress[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0msubnet_ids[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m       = {
          [32m+[0m [0m"Name" = "wp_private_nacl"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m     = (known after apply)
    }

[1m  # module.networking.aws_network_acl.public[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl" "public" {
      [32m+[0m [0m[1m[0marn[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0megress[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0msubnet_ids[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m       = {
          [32m+[0m [0m"Name" = "wp_public_nacl"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m     = (known after apply)
    }

[1m  # module.networking.aws_network_acl_rule.private_egress_Allow_all_traffic[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private_egress_Allow_all_traffic" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 0
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "-1"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 500
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 0
    }

[1m  # module.networking.aws_network_acl_rule.private_egress_ephemeral_vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private_egress_ephemeral_vpc" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "10.0.0.0/16"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 1024
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 200
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 65535
    }

[1m  # module.networking.aws_network_acl_rule.private_egress_http_vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private_egress_http_vpc" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "10.0.0.0/16"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 80
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 300
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 80
    }

[1m  # module.networking.aws_network_acl_rule.private_egress_https_vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private_egress_https_vpc" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 443
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 400
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 443
    }

[1m  # module.networking.aws_network_acl_rule.private_egress_ssh_vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private_egress_ssh_vpc" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "10.0.0.0/16"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 22
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 100
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 22
    }

[1m  # module.networking.aws_network_acl_rule.private_ingress_Allow_all_traffic[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private_ingress_Allow_all_traffic" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = false
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 0
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "-1"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 400
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 0
    }

[1m  # module.networking.aws_network_acl_rule.private_ingress_ephemeral_vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private_ingress_ephemeral_vpc" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "10.0.0.0/16"
      [32m+[0m [0m[1m[0megress[0m[0m         = false
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 1024
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 200
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 65535
    }

[1m  # module.networking.aws_network_acl_rule.private_ingress_https_vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private_ingress_https_vpc" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "10.0.0.0/16"
      [32m+[0m [0m[1m[0megress[0m[0m         = false
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 443
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 300
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 443
    }

[1m  # module.networking.aws_network_acl_rule.private_ingress_ssh_vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "private_ingress_ssh_vpc" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "10.0.0.0/16"
      [32m+[0m [0m[1m[0megress[0m[0m         = false
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 22
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 100
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 22
    }

[1m  # module.networking.aws_network_acl_rule.public_egress_Allow_all_traffic1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_egress_Allow_all_traffic1" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "10.0.0.0/16"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 0
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "-1"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 700
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 0
    }

[1m  # module.networking.aws_network_acl_rule.public_egress_ephemeral[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_egress_ephemeral" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 1024
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 200
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 65535
    }

[1m  # module.networking.aws_network_acl_rule.public_egress_http[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_egress_http" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 80
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 500
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 80
    }

[1m  # module.networking.aws_network_acl_rule.public_egress_https[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_egress_https" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 443
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 600
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 443
    }

[1m  # module.networking.aws_network_acl_rule.public_egress_ping[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_egress_ping" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0micmp_code[0m[0m      = "-1"
      [32m+[0m [0m[1m[0micmp_type[0m[0m      = "8"
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "icmp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 300
    }

[1m  # module.networking.aws_network_acl_rule.public_egress_ping_response[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_egress_ping_response" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0micmp_code[0m[0m      = "-1"
      [32m+[0m [0m[1m[0micmp_type[0m[0m      = "0"
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "icmp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 400
    }

[1m  # module.networking.aws_network_acl_rule.public_egress_ssh_vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_egress_ssh_vpc" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "10.0.0.0/16"
      [32m+[0m [0m[1m[0megress[0m[0m         = true
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 22
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 100
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 22
    }

[1m  # module.networking.aws_network_acl_rule.public_ingress_Allow_all_traffic1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_ingress_Allow_all_traffic1" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = false
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 0
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "-1"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 600
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 0
    }

[1m  # module.networking.aws_network_acl_rule.public_ingress_echo_response_from_anywhere[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_ingress_echo_response_from_anywhere" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = false
      [32m+[0m [0m[1m[0micmp_code[0m[0m      = "-1"
      [32m+[0m [0m[1m[0micmp_type[0m[0m      = "0"
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "icmp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 200
    }

[1m  # module.networking.aws_network_acl_rule.public_ingress_ephemeral[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_ingress_ephemeral" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = false
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 1024
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 400
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 65535
    }

[1m  # module.networking.aws_network_acl_rule.public_ingress_https[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_ingress_https" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "0.0.0.0/0"
      [32m+[0m [0m[1m[0megress[0m[0m         = false
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 443
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 500
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 443
    }

[1m  # module.networking.aws_network_acl_rule.public_ingress_icmp_from_home_network[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_ingress_icmp_from_home_network" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "101.181.70.69/32"
      [32m+[0m [0m[1m[0megress[0m[0m         = false
      [32m+[0m [0m[1m[0micmp_code[0m[0m      = "-1"
      [32m+[0m [0m[1m[0micmp_type[0m[0m      = "-1"
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "icmp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 100
    }

[1m  # module.networking.aws_network_acl_rule.public_ingress_ssh_from_home_network[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_network_acl_rule" "public_ingress_ssh_from_home_network" {
      [32m+[0m [0m[1m[0mcidr_block[0m[0m     = "101.181.70.69/32"
      [32m+[0m [0m[1m[0megress[0m[0m         = false
      [32m+[0m [0m[1m[0mfrom_port[0m[0m      = 22
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnetwork_acl_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m       = "tcp"
      [32m+[0m [0m[1m[0mrule_action[0m[0m    = "allow"
      [32m+[0m [0m[1m[0mrule_number[0m[0m    = 300
      [32m+[0m [0m[1m[0mto_port[0m[0m        = 22
    }

[1m  # module.networking.aws_route_table.private[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table" "private" {
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m            = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_block                = "0.0.0.0/0"
              [32m+[0m [0megress_only_gateway_id    = ""
              [32m+[0m [0mgateway_id                = (known after apply)
              [32m+[0m [0minstance_id               = ""
              [32m+[0m [0mipv6_cidr_block           = ""
              [32m+[0m [0mnat_gateway_id            = ""
              [32m+[0m [0mnetwork_interface_id      = ""
              [32m+[0m [0mtransit_gateway_id        = ""
              [32m+[0m [0mvpc_peering_connection_id = ""
            },
        ]
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name" = "wp_rt_private"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)
    }

[1m  # module.networking.aws_route_table.public[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table" "public" {
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpropagating_vgws[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroute[0m[0m            = [
          [32m+[0m [0m{
              [32m+[0m [0mcidr_block                = "0.0.0.0/0"
              [32m+[0m [0megress_only_gateway_id    = ""
              [32m+[0m [0mgateway_id                = (known after apply)
              [32m+[0m [0minstance_id               = ""
              [32m+[0m [0mipv6_cidr_block           = ""
              [32m+[0m [0mnat_gateway_id            = ""
              [32m+[0m [0mnetwork_interface_id      = ""
              [32m+[0m [0mtransit_gateway_id        = ""
              [32m+[0m [0mvpc_peering_connection_id = ""
            },
        ]
      [32m+[0m [0m[1m[0mtags[0m[0m             = {
          [32m+[0m [0m"Name" = "wp_rt_public"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m           = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.private_subnet[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "private_subnet" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.private_subnet[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "private_subnet" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.public_subnet[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "public_subnet" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.networking.aws_route_table_association.public_subnet[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_route_table_association" "public_subnet" {
      [32m+[0m [0m[1m[0mid[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mroute_table_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_id[0m[0m      = (known after apply)
    }

[1m  # module.networking.aws_subnet.private[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m               = "ap-southeast-2a"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                      = "10.0.10.0/24"
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m         = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                            = {
          [32m+[0m [0m"Name" = "wp_private_ap-southeast-2a"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                          = (known after apply)
    }

[1m  # module.networking.aws_subnet.private[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "private" {
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m               = "ap-southeast-2b"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                      = "10.0.11.0/24"
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m         = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                            = {
          [32m+[0m [0m"Name" = "wp_private_ap-southeast-2b"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                          = (known after apply)
    }

[1m  # module.networking.aws_subnet.public[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m               = "ap-southeast-2a"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                      = "10.0.0.0/24"
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m         = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                            = {
          [32m+[0m [0m"Name" = "wp_public_ap-southeast-2a"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                          = (known after apply)
    }

[1m  # module.networking.aws_subnet.public[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_subnet" "public" {
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0massign_ipv6_address_on_creation[0m[0m = false
      [32m+[0m [0m[1m[0mavailability_zone[0m[0m               = "ap-southeast-2b"
      [32m+[0m [0m[1m[0mavailability_zone_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                      = "10.0.1.0/24"
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block_association_id[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mmap_public_ip_on_launch[0m[0m         = false
      [32m+[0m [0m[1m[0mowner_id[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                            = {
          [32m+[0m [0m"Name" = "wp_public_ap-southeast-2b"
        }
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                          = (known after apply)
    }

[1m  # module.networking.aws_vpc.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_vpc" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0massign_generated_ipv6_cidr_block[0m[0m = false
      [32m+[0m [0m[1m[0mcidr_block[0m[0m                       = "10.0.0.0/16"
      [32m+[0m [0m[1m[0mdefault_network_acl_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_route_table_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_security_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mdhcp_options_id[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0menable_classiclink[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0menable_classiclink_dns_support[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0menable_dns_hostnames[0m[0m             = true
      [32m+[0m [0m[1m[0menable_dns_support[0m[0m               = true
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0minstance_tenancy[0m[0m                 = "default"
      [32m+[0m [0m[1m[0mipv6_association_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mipv6_cidr_block[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mmain_route_table_id[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mowner_id[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                             = {
          [32m+[0m [0m"Name" = "wp_vpc"
        }
    }

[1m  # module.rds.aws_db_parameter_group.aurora_db_mysql57_parameter_group[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_db_parameter_group" "aurora_db_mysql57_parameter_group" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "test-aurora57-parameter-group"
      [32m+[0m [0m[1m[0mfamily[0m[0m      = "aurora-mysql5.7"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "test-aurora57-parameter-group"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m = (known after apply)
    }

[1m  # module.rds.aws_db_subnet_group.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_db_subnet_group" "this" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "Managed by Terraform"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "rdssubnet"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msubnet_ids[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m        = {
          [32m+[0m [0m"Name" = "RDS DB Subnet Group"
        }
    }

[1m  # module.rds.aws_rds_cluster.this[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_rds_cluster" "this" {
      [32m+[0m [0m[1m[0mapply_immediately[0m[0m               = true
      [32m+[0m [0m[1m[0marn[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mavailability_zones[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mbackup_retention_period[0m[0m         = 1
      [32m+[0m [0m[1m[0mcluster_identifier[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mcluster_identifier_prefix[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mcluster_members[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mcluster_resource_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mcopy_tags_to_snapshot[0m[0m           = false
      [32m+[0m [0m[1m[0mdatabase_name[0m[0m                   = "wordpress"
      [32m+[0m [0m[1m[0mdb_cluster_parameter_group_name[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdb_subnet_group_name[0m[0m            = "rdssubnet"
      [32m+[0m [0m[1m[0mdeletion_protection[0m[0m             = false
      [32m+[0m [0m[1m[0menable_http_endpoint[0m[0m            = false
      [32m+[0m [0m[1m[0mendpoint[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mengine[0m[0m                          = "aurora"
      [32m+[0m [0m[1m[0mengine_mode[0m[0m                     = "serverless"
      [32m+[0m [0m[1m[0mengine_version[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mmaster_password[0m[0m                 = (sensitive value)
      [32m+[0m [0m[1m[0mmaster_username[0m[0m                 = "root"
      [32m+[0m [0m[1m[0mport[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mpreferred_backup_window[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpreferred_maintenance_window[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mreader_endpoint[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mskip_final_snapshot[0m[0m             = true
      [32m+[0m [0m[1m[0mstorage_encrypted[0m[0m               = true
      [32m+[0m [0m[1m[0mvpc_security_group_ids[0m[0m          = (known after apply)

      [32m+[0m [0mscaling_configuration {
          [32m+[0m [0m[1m[0mauto_pause[0m[0m               = true
          [32m+[0m [0m[1m[0mmax_capacity[0m[0m             = 256
          [32m+[0m [0m[1m[0mmin_capacity[0m[0m             = 2
          [32m+[0m [0m[1m[0mseconds_until_auto_pause[0m[0m = 300
          [32m+[0m [0m[1m[0mtimeout_action[0m[0m           = "ForceApplyCapacityChange"
        }
    }

[1m  # module.rds.aws_rds_cluster_parameter_group.aurora_cluster_mysql57_parameter_group[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_rds_cluster_parameter_group" "aurora_cluster_mysql57_parameter_group" {
      [32m+[0m [0m[1m[0marn[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m = "test-aurora57-cluster-parameter-group"
      [32m+[0m [0m[1m[0mfamily[0m[0m      = "aurora5.6"
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "test-aurora57-cluster-parameter-group"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m = (known after apply)
    }

[1m  # module.rds.aws_security_group.rds[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group" "rds" {
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m            = "RDS SG"
      [32m+[0m [0m[1m[0megress[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mingress[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                   = "project1_ext1_rds_sg"
      [32m+[0m [0m[1m[0mowner_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mrevoke_rules_on_delete[0m[0m = false
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                 = (known after apply)
    }

[1m  # module.rds.aws_security_group_rule.allow_baston_access[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group_rule" "allow_baston_access" {
      [32m+[0m [0m[1m[0mfrom_port[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m                 = "tcp"
      [32m+[0m [0m[1m[0msecurity_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mself[0m[0m                     = false
      [32m+[0m [0m[1m[0msource_security_group_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mto_port[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m                     = "ingress"
    }

[1m  # module.rds.aws_security_group_rule.allow_ec2_access[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_security_group_rule" "allow_ec2_access" {
      [32m+[0m [0m[1m[0mfrom_port[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mprotocol[0m[0m                 = "tcp"
      [32m+[0m [0m[1m[0msecurity_group_id[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mself[0m[0m                     = false
      [32m+[0m [0m[1m[0msource_security_group_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mto_port[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m                     = "ingress"
    }

[1m  # module.rds.aws_ssm_parameter.db_host[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ssm_parameter" "db_host" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdata_type[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mkey_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = "/wordpress/WORDPRESS_DB_HOST"
      [32m+[0m [0m[1m[0moverwrite[0m[0m = true
      [32m+[0m [0m[1m[0mtier[0m[0m      = "Standard"
      [32m+[0m [0m[1m[0mtype[0m[0m      = "SecureString"
      [32m+[0m [0m[1m[0mvalue[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mversion[0m[0m   = (known after apply)
    }

[1m  # module.rds.aws_ssm_parameter.db_name[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ssm_parameter" "db_name" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdata_type[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mkey_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = "/wordpress/WORDPRESS_DB_NAME"
      [32m+[0m [0m[1m[0moverwrite[0m[0m = true
      [32m+[0m [0m[1m[0mtier[0m[0m      = "Standard"
      [32m+[0m [0m[1m[0mtype[0m[0m      = "SecureString"
      [32m+[0m [0m[1m[0mvalue[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mversion[0m[0m   = (known after apply)
    }

[1m  # module.rds.aws_ssm_parameter.db_password[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ssm_parameter" "db_password" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdata_type[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mkey_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = "/wordpress/WORDPRESS_DB_PASSWORD"
      [32m+[0m [0m[1m[0moverwrite[0m[0m = false
      [32m+[0m [0m[1m[0mtier[0m[0m      = "Standard"
      [32m+[0m [0m[1m[0mtype[0m[0m      = "SecureString"
      [32m+[0m [0m[1m[0mvalue[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mversion[0m[0m   = (known after apply)
    }

[1m  # module.rds.aws_ssm_parameter.db_user[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ssm_parameter" "db_user" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mdata_type[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mkey_id[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = "/wordpress/WORDPRESS_DB_USER"
      [32m+[0m [0m[1m[0moverwrite[0m[0m = false
      [32m+[0m [0m[1m[0mtier[0m[0m      = "Standard"
      [32m+[0m [0m[1m[0mtype[0m[0m      = "SecureString"
      [32m+[0m [0m[1m[0mvalue[0m[0m     = (sensitive value)
      [32m+[0m [0m[1m[0mversion[0m[0m   = (known after apply)
    }

[1m  # module.rds.random_password.rds_password[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_password" "rds_password" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 10
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = true
      [32m+[0m [0m[1m[0mresult[0m[0m      = (sensitive value)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = true
    }

[0m[1mPlan:[0m 80 to add, 0 to change, 0 to destroy.[0m
[0m
[1mChanges to Outputs:[0m
  [32m+[0m [0m[1m[0mbastion_ssh_command[0m[0m = (known after apply)
  [32m+[0m [0m[1m[0mecr_url[0m[0m             = (known after apply)
  [33m~[0m [0m[1m[0mmysql_command[0m[0m       = {
      [33m~[0m [0mcommand  = [90mnull[0m[0m [33m->[0m [0m(known after apply)
      [33m~[0m [0mpassword = [90mnull[0m[0m [33m->[0m [0m(known after apply)
    }[0m

------------------------------------------------------------------------

This plan was saved to: project1_tf_plan

To perform exactly these actions, run the following command to apply:
    terraform apply "project1_tf_plan"

```